HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxCif_reg.h
/** Alias (User Manual Name) for CIF_EP_IC_1S0_V_OFFS_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S0_V_OFFS_SHD.
*/
#define	CIFEP_1_IC_V_OFFS_SHD	(CIF_EP_IC_1S0_V_OFFS_SHD)

/** \\brief  2A14, Extra Path Image Cropping Output Vertical Picture Size
 * Register */
#define CIF_EP_IC_1S0_V_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_V_SIZE*)0xF90E4914u)

/** Alias (User Manual Name) for CIF_EP_IC_1S0_V_SIZE.
* To use register names with standard convension, please use CIF_EP_IC_1S0_V_SIZE.
*/
#define	CIFEP_1_IC_V_SIZE	(CIF_EP_IC_1S0_V_SIZE)

/** \\brief  2A30, Extra Path Image Current Output Vertical Picture Size Shadow
 * Register */
#define CIF_EP_IC_1S0_V_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_V_SIZE_SHD*)0xF90E4930u)

/** Alias (User Manual Name) for CIF_EP_IC_1S0_V_SIZE_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S0_V_SIZE_SHD.
*/
#define	CIFEP_1_IC_V_SIZE_SHD	(CIF_EP_IC_1S0_V_SIZE_SHD)

/** \\brief  2B00, Extra Path Image Cropping Control Register */
#define CIF_EP_IC_1S1_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_CTRL*)0xF90E4A00u)

/** Alias (User Manual Name) for CIF_EP_IC_1S1_CTRL.
* To use register names with standard convension, please use CIF_EP_IC_1S1_CTRL.
*/
#define	CIFEP_2_IC_CTRL	(CIF_EP_IC_1S1_CTRL)

/** \\brief  2B20, Extra Path Image Cropping Camera Displacement Register */
#define CIF_EP_IC_1S1_DISPLACE /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_DISPLACE*)0xF90E4A20u)

/** Alias (User Manual Name) for CIF_EP_IC_1S1_DISPLACE.
* To use register names with standard convension, please use CIF_EP_IC_1S1_DISPLACE.
*/
#define	CIFEP_2_IC_DISPLACE	(CIF_EP_IC_1S1_DISPLACE)

/** \\brief  2B08, Extra Path Image Cropping Horizontal Offset of Output Window
 * Register */
#define CIF_EP_IC_1S1_H_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_H_OFFS*)0xF90E4A08u)

/** Alias (User Manual Name) for CIF_EP_IC_1S1_H_OFFS.
* To use register names with standard convension, please use CIF_EP_IC_1S1_H_OFFS.
*/
#define	CIFEP_2_IC_H_OFFS	(CIF_EP_IC_1S1_H_OFFS)

/** \\brief  2B24, Extra Path Image Current Horizontal Offset Of Output Window
 * Shadow Register */
#define CIF_EP_IC_1S1_H_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_H_OFFS_SHD*)0xF90E4A24u)

/** Alias (User Manual Name) for CIF_EP_IC_1S1_H_OFFS_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S1_H_OFFS_SHD.
*/
#define	CIFEP_2_IC_H_OFFS_SHD	(CIF_EP_IC_1S1_H_OFFS_SHD)

/** \\brief  2B10, Extra Path Image Cropping Output Horizontal Picture Size
 * Register */
#define CIF_EP_IC_1S1_H_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_H_SIZE*)0xF90E4A10u)

/** Alias (User Manual Name) for CIF_EP_IC_1S1_H_SIZE.
* To use register names with standard convension, please use CIF_EP_IC_1S1_H_SIZE.
*/
#define	CIFEP_2_IC_H_SIZE	(CIF_EP_IC_1S1_H_SIZE)

/** \\brief  2B2C, Extra Path Image Current Output Horizontal Picture Size
 * Shadow Register */
#define CIF_EP_IC_1S1_H_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_H_SIZE_SHD*)0xF90E4A2Cu)

/** Alias (User Manual Name) for CIF_EP_IC_1S1_H_SIZE_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S1_H_SIZE_SHD.
*/
#define	CIFEP_2_IC_H_SIZE_SHD	(CIF_EP_IC_1S1_H_SIZE_SHD)

/** \\brief  2B18, Extra Path Image Cropping Maximum Horizontal Displacement
 * Register */
#define CIF_EP_IC_1S1_MAX_DX /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_MAX_DX*)0xF90E4A18u)

/** Alias (User Manual Name) for CIF_EP_IC_1S1_MAX_DX.
* To use register names with standard convension, please use CIF_EP_IC_1S1_MAX_DX.
*/
#define	CIFEP_2_IC_MAX_DX	(CIF_EP_IC_1S1_MAX_DX)

/** \\brief  2B1C, Extra Path Image Cropping Maximum Vertical Displacement
 * Register */
#define CIF_EP_IC_1S1_MAX_DY /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_MAX_DY*)0xF90E4A1Cu)

/** Alias (User Manual Name) for CIF_EP_IC_1S1_MAX_DY.
* To use register names with standard convension, please use CIF_EP_IC_1S1_MAX_DY.
*/
#define	CIFEP_2_IC_MAX_DY	(CIF_EP_IC_1S1_MAX_DY)

/** \\brief  2B04, Extra Path Image Cropping Recenter Register */
#define CIF_EP_IC_1S1_RECENTER /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_RECENTER*)0xF90E4A04u)

/** Alias (User Manual Name) for CIF_EP_IC_1S1_RECENTER.
* To use register names with standard convension, please use CIF_EP_IC_1S1_RECENTER.
*/
#define	CIFEP_2_IC_RECENTER	(CIF_EP_IC_1S1_RECENTER)

/** \\brief  2B0C, Extra Path Image Cropping Vertical Offset Of Output Window
 * Register */
#define CIF_EP_IC_1S1_V_OFFS /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_V_OFFS*)0xF90E4A0Cu)

/** Alias (User Manual Name) for CIF_EP_IC_1S1_V_OFFS.
* To use register names with standard convension, please use CIF_EP_IC_1S1_V_OFFS.
*/
#define	CIFEP_2_IC_V_OFFS	(CIF_EP_IC_1S1_V_OFFS)

/** \\brief  2B28, Extra Path Image Current Vertical Offset Of Output Window
 * Shadow Register */
#define CIF_EP_IC_1S1_V_OFFS_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_V_OFFS_SHD*)0xF90E4A28u)

/** Alias (User Manual Name) for CIF_EP_IC_1S1_V_OFFS_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S1_V_OFFS_SHD.
*/
#define	CIFEP_2_IC_V_OFFS_SHD	(CIF_EP_IC_1S1_V_OFFS_SHD)

/** \\brief  2B14, Extra Path Image Cropping Output Vertical Picture Size
 * Register */
#define CIF_EP_IC_1S1_V_SIZE /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_V_SIZE*)0xF90E4A14u)

/** Alias (User Manual Name) for CIF_EP_IC_1S1_V_SIZE.
* To use register names with standard convension, please use CIF_EP_IC_1S1_V_SIZE.
*/
#define	CIFEP_2_IC_V_SIZE	(CIF_EP_IC_1S1_V_SIZE)

/** \\brief  2B30, Extra Path Image Current Output Vertical Picture Size Shadow
 * Register */
#define CIF_EP_IC_1S1_V_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_V_SIZE_SHD*)0xF90E4A30u)

/** Alias (User Manual Name) for CIF_EP_IC_1S1_V_SIZE_SHD.
* To use register names with standard convension, please use CIF_EP_IC_1S1_V_SIZE_SHD.
*/
#define	CIFEP_2_IC_V_SIZE_SHD	(CIF_EP_IC_1S1_V_SIZE_SHD)

/** \\brief  2C00, Extra Path Image Cropping Control Register */
#define CIF_EP_IC_1S2_CTRL /*lint --e(923)*/ (*(volatile Ifx_CIF_EP_IC_CTRL*)0xF90E4B00u)

/** Alias (User Manual Name) for CIF_EP_IC_1S2_CTRL.
* To use register names with standard convension, please use CIF_EP_IC_1S2_CTRL.
*/
#define	CIFEP_3_IC_CTRL	(CIF_EP_IC_1S2_CTRL)

