HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxCif_reg.h
/** Alias (User Manual Name) for CIF_MI_CTRL.
* To use register names with standard convension, please use CIF_MI_CTRL.
*/
#define	CIFMI_CTRL	(CIF_MI_CTRL)

/** \\brief  1574, Memory Interface Global Control Internal Shadow Register */
#define CIF_MI_CTRL_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_CTRL_SHD*)0xF90E3474u)

/** Alias (User Manual Name) for CIF_MI_CTRL_SHD.
* To use register names with standard convension, please use CIF_MI_CTRL_SHD.
*/
#define	CIFMI_CTRL_SHD	(CIF_MI_CTRL_SHD)

/** \\brief  1604, MI Interrupt Clear Register */
#define CIF_MI_ICR /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_ICR*)0xF90E3504u)

/** Alias (User Manual Name) for CIF_MI_ICR.
* To use register names with standard convension, please use CIF_MI_ICR.
*/
#define	CIFMI_ICR	(CIF_MI_ICR)

/** \\brief  15F8, MI Interrupt Mask ‘1’ interrupt active ‘0’ interrupt masked */
#define CIF_MI_IMSC /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_IMSC*)0xF90E34F8u)

/** Alias (User Manual Name) for CIF_MI_IMSC.
* To use register names with standard convension, please use CIF_MI_IMSC.
*/
#define	CIFMI_IMSC	(CIF_MI_IMSC)

/** \\brief  1504, Memory Interface Control Register For Address Init And Skip
 * Function Register */
#define CIF_MI_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_INIT*)0xF90E3404u)

/** Alias (User Manual Name) for CIF_MI_INIT.
* To use register names with standard convension, please use CIF_MI_INIT.
*/
#define	CIFMI_INIT	(CIF_MI_INIT)

/** \\brief  1608, MI Interrupt Set Register */
#define CIF_MI_ISR /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_ISR*)0xF90E3508u)

/** Alias (User Manual Name) for CIF_MI_ISR.
* To use register names with standard convension, please use CIF_MI_ISR.
*/
#define	CIFMI_ISR	(CIF_MI_ISR)

/** \\brief  1600, MI Masked Interrupt Status Registe */
#define CIF_MI_MIS /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MIS*)0xF90E3500u)

/** Alias (User Manual Name) for CIF_MI_MIS.
* To use register names with standard convension, please use CIF_MI_MIS.
*/
#define	CIFMI_MIS	(CIF_MI_MIS)

/** \\brief  151C, Memory Interface Base Address For Main Picture Cb Component
 * Ring Buffer Register */
#define CIF_MI_MP_CB_BASE_AD_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_CB_BASE_AD_INIT*)0xF90E341Cu)

/** Alias (User Manual Name) for CIF_MI_MP_CB_BASE_AD_INIT.
* To use register names with standard convension, please use CIF_MI_MP_CB_BASE_AD_INIT.
*/
#define	CIFMI_MP_CB_BASE_AD_INIT	(CIF_MI_MP_CB_BASE_AD_INIT)

/** \\brief  1588, Memory Interface Base Address Shadow Register For Main
 * Picture Cb Component Ring Register */
#define CIF_MI_MP_CB_BASE_AD_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_CB_BASE_AD_SHD*)0xF90E3488u)

/** Alias (User Manual Name) for CIF_MI_MP_CB_BASE_AD_SHD.
* To use register names with standard convension, please use CIF_MI_MP_CB_BASE_AD_SHD.
*/
#define	CIFMI_MP_CB_BASE_AD_SHD	(CIF_MI_MP_CB_BASE_AD_SHD)

/** \\brief  1524, Memory Interface Offset Counter Init Value For Main Picture
 * Cb Component Ring Buffer Register */
#define CIF_MI_MP_CB_OFFS_CNT_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_CB_OFFS_CNT_INIT*)0xF90E3424u)

/** Alias (User Manual Name) for CIF_MI_MP_CB_OFFS_CNT_INIT.
* To use register names with standard convension, please use CIF_MI_MP_CB_OFFS_CNT_INIT.
*/
#define	CIFMI_MP_CB_OFFS_CNT_INIT	(CIF_MI_MP_CB_OFFS_CNT_INIT)

/** \\brief  1590, Memory Interface Current Offset Counter Of Main Picture Cb
 * Component Ring Buffer Register */
#define CIF_MI_MP_CB_OFFS_CNT_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_CB_OFFS_CNT_SHD*)0xF90E3490u)

/** Alias (User Manual Name) for CIF_MI_MP_CB_OFFS_CNT_SHD.
* To use register names with standard convension, please use CIF_MI_MP_CB_OFFS_CNT_SHD.
*/
#define	CIFMI_MP_CB_OFFS_CNT_SHD	(CIF_MI_MP_CB_OFFS_CNT_SHD)

/** \\brief  1528, Memory Interface Offset Counter Start Value For Main Picture
 * Cb Component Ring Buffer Register */
#define CIF_MI_MP_CB_OFFS_CNT_START /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_CB_OFFS_CNT_START*)0xF90E3428u)

/** Alias (User Manual Name) for CIF_MI_MP_CB_OFFS_CNT_START.
* To use register names with standard convension, please use CIF_MI_MP_CB_OFFS_CNT_START.
*/
#define	CIFMI_MP_CB_OFFS_CNT_START	(CIF_MI_MP_CB_OFFS_CNT_START)

/** \\brief  1520, Memory Interface Size Of Main Picture Cb Component Ring
 * Buffer Register */
#define CIF_MI_MP_CB_SIZE_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_CB_SIZE_INIT*)0xF90E3420u)

/** Alias (User Manual Name) for CIF_MI_MP_CB_SIZE_INIT.
* To use register names with standard convension, please use CIF_MI_MP_CB_SIZE_INIT.
*/
#define	CIFMI_MP_CB_SIZE_INIT	(CIF_MI_MP_CB_SIZE_INIT)

/** \\brief  158C, Memory Interface Size Shadow Register Of Main Picture Cb
 * Component Ring Buffer Register */
#define CIF_MI_MP_CB_SIZE_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_CB_SIZE_SHD*)0xF90E348Cu)

/** Alias (User Manual Name) for CIF_MI_MP_CB_SIZE_SHD.
* To use register names with standard convension, please use CIF_MI_MP_CB_SIZE_SHD.
*/
#define	CIFMI_MP_CB_SIZE_SHD	(CIF_MI_MP_CB_SIZE_SHD)

/** \\brief  152C, Memory Interface Base Address For Main Picture Cr Component
 * Ring Buffer Register */
#define CIF_MI_MP_CR_BASE_AD_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_CR_BASE_AD_INIT*)0xF90E342Cu)

/** Alias (User Manual Name) for CIF_MI_MP_CR_BASE_AD_INIT.
* To use register names with standard convension, please use CIF_MI_MP_CR_BASE_AD_INIT.
*/
#define	CIFMI_MP_CR_BASE_AD_INIT	(CIF_MI_MP_CR_BASE_AD_INIT)

/** \\brief  1594, Memory Interface Base Address Shadow Register For Main
 * Picture Cr Component Ring Register */
#define CIF_MI_MP_CR_BASE_AD_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_CR_BASE_AD_SHD*)0xF90E3494u)

/** Alias (User Manual Name) for CIF_MI_MP_CR_BASE_AD_SHD.
* To use register names with standard convension, please use CIF_MI_MP_CR_BASE_AD_SHD.
*/
#define	CIFMI_MP_CR_BASE_AD_SHD	(CIF_MI_MP_CR_BASE_AD_SHD)

/** \\brief  1534, Memory Interface Offset Counter Init value For Main Picture
 * Cr Component Ring Buffer Register */
#define CIF_MI_MP_CR_OFFS_CNT_INIT /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_CR_OFFS_CNT_INIT*)0xF90E3434u)

/** Alias (User Manual Name) for CIF_MI_MP_CR_OFFS_CNT_INIT.
* To use register names with standard convension, please use CIF_MI_MP_CR_OFFS_CNT_INIT.
*/
#define	CIFMI_MP_CR_OFFS_CNT_INIT	(CIF_MI_MP_CR_OFFS_CNT_INIT)

/** \\brief  159C, Memory Interface Current Offset Counter Of Main Picture Cr
 * Component Ring Buffer Register */
#define CIF_MI_MP_CR_OFFS_CNT_SHD /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_CR_OFFS_CNT_SHD*)0xF90E349Cu)

/** Alias (User Manual Name) for CIF_MI_MP_CR_OFFS_CNT_SHD.
* To use register names with standard convension, please use CIF_MI_MP_CR_OFFS_CNT_SHD.
*/
#define	CIFMI_MP_CR_OFFS_CNT_SHD	(CIF_MI_MP_CR_OFFS_CNT_SHD)

/** \\brief  1538, Memory Interface Offset Counter Start Value For Main Picture
 * Cr Component Ring Buffer Register */
#define CIF_MI_MP_CR_OFFS_CNT_START /*lint --e(923)*/ (*(volatile Ifx_CIF_MI_MP_CR_OFFS_CNT_START*)0xF90E3438u)

/** Alias (User Manual Name) for CIF_MI_MP_CR_OFFS_CNT_START.
* To use register names with standard convension, please use CIF_MI_MP_CR_OFFS_CNT_START.
*/
#define	CIFMI_MP_CR_OFFS_CNT_START	(CIF_MI_MP_CR_OFFS_CNT_START)

