HAMES2-1st-3/TunnelComfortSystemTesting/include/tc26xa/IfxCif_reg.h
/** \\brief  2508, Watchdog Horizontal Timeout Register */
#define CIF_WD_H_TIMEOUT /*lint --e(923)*/ (*(volatile Ifx_CIF_WD_H_TIMEOUT*)0xF90E4408u)

/** Alias (User Manual Name) for CIF_WD_H_TIMEOUT.
* To use register names with standard convension, please use CIF_WD_H_TIMEOUT.
*/
#define	CIFWD_H_TIMEOUT	(CIF_WD_H_TIMEOUT)

/** \\brief  2518, Watchdog Interrupt Clear Register */
#define CIF_WD_ICR /*lint --e(923)*/ (*(volatile Ifx_CIF_WD_ICR*)0xF90E4418u)

/** Alias (User Manual Name) for CIF_WD_ICR.
* To use register names with standard convension, please use CIF_WD_ICR.
*/
#define	CIFWD_ICR	(CIF_WD_ICR)

/** \\brief  250C, Watchdog Interrupt Mask Register */
#define CIF_WD_IMSC /*lint --e(923)*/ (*(volatile Ifx_CIF_WD_IMSC*)0xF90E440Cu)

/** Alias (User Manual Name) for CIF_WD_IMSC.
* To use register names with standard convension, please use CIF_WD_IMSC.
*/
#define	CIFWD_IMSC	(CIF_WD_IMSC)

/** \\brief  251C, Watchdog Interrupt Set Register */
#define CIF_WD_ISR /*lint --e(923)*/ (*(volatile Ifx_CIF_WD_ISR*)0xF90E441Cu)

/** Alias (User Manual Name) for CIF_WD_ISR.
* To use register names with standard convension, please use CIF_WD_ISR.
*/
#define	CIFWD_ISR	(CIF_WD_ISR)

/** \\brief  2514, Watchdog Masked Interrupt Status Register */
#define CIF_WD_MIS /*lint --e(923)*/ (*(volatile Ifx_CIF_WD_MIS*)0xF90E4414u)

/** Alias (User Manual Name) for CIF_WD_MIS.
* To use register names with standard convension, please use CIF_WD_MIS.
*/
#define	CIFWD_MIS	(CIF_WD_MIS)

/** \\brief  2510, Watchdog Raw Interrupt Status Register */
#define CIF_WD_RIS /*lint --e(923)*/ (*(volatile Ifx_CIF_WD_RIS*)0xF90E4410u)

/** Alias (User Manual Name) for CIF_WD_RIS.
* To use register names with standard convension, please use CIF_WD_RIS.
*/
#define	CIFWD_RIS	(CIF_WD_RIS)

/** \\brief  2504, Watchdog Vertical Timeout Register */
#define CIF_WD_V_TIMEOUT /*lint --e(923)*/ (*(volatile Ifx_CIF_WD_V_TIMEOUT*)0xF90E4404u)

/** Alias (User Manual Name) for CIF_WD_V_TIMEOUT.
* To use register names with standard convension, please use CIF_WD_V_TIMEOUT.
*/
#define	CIFWD_V_TIMEOUT	(CIF_WD_V_TIMEOUT)
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXCIF_REG_H */
